Hi @jasminen ,

I've just tested on provider v1.7.1, Postgresql 14 and it works for me:


```
$ terraform apply
[...]
  # postgresql_database.this will be created
  + resource "postgresql_database" "this" {
      + allow_connections = true
      + connection_limit  = -1
      + encoding          = (known after apply)
      + id                = (known after apply)
      + is_template       = (known after apply)
      + lc_collate        = (known after apply)
      + lc_ctype          = (known after apply)
      + name              = "test"
      + owner             = (known after apply)
      + tablespace_name   = (known after apply)
      + template          = (known after apply)
    }

  # postgresql_grant.database_to_public will be created
  + resource "postgresql_grant" "database_to_public" {
      + database          = "test"
      + id                = (known after apply)
      + object_type       = "database"
      + privileges        = [
          + "TEMPORARY",
        ]
      + role              = "public"
      + with_grant_option = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.
[...]
Apply complete! Resources: 2 added, 0 changed, 0 destroyed.


$ psql -l 
                                 List of databases
   Name    |  Owner   | Encoding |  Collate   |   Ctype    |   Access privileges   
-----------+----------+----------+------------+------------+-----------------------
 postgres  | postgres | UTF8     | en_US.utf8 | en_US.utf8 | 
 template0 | postgres | UTF8     | en_US.utf8 | en_US.utf8 | =c/postgres          +
           |          |          |            |            | postgres=CTc/postgres
 template1 | postgres | UTF8     | en_US.utf8 | en_US.utf8 | =c/postgres          +
           |          |          |            |            | postgres=CTc/postgres
 test      | postgres | UTF8     | en_US.utf8 | en_US.utf8 | postgres=CTc/postgres+
           |          |          |            |            | =T/postgres
(4 rows)

$ terraform destroy -target postgresql_grant.database_to_public
Terraform will perform the following actions:

  # postgresql_grant.database_to_public will be destroyed
  - resource "postgresql_grant" "database_to_public" {
      - database          = "test" -> null
      - id                = "public_test_database" -> null
      - object_type       = "database" -> null
      - privileges        = [
          - "TEMPORARY",
        ] -> null
      - role              = "public" -> null
      - with_grant_option = false -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
[...]
Destroy complete! Resources: 1 destroyed.

$ psql -l
                                 List of databases
   Name    |  Owner   | Encoding |  Collate   |   Ctype    |   Access privileges   
-----------+----------+----------+------------+------------+-----------------------
 postgres  | postgres | UTF8     | en_US.utf8 | en_US.utf8 | 
 template0 | postgres | UTF8     | en_US.utf8 | en_US.utf8 | =c/postgres          +
           |          |          |            |            | postgres=CTc/postgres
 template1 | postgres | UTF8     | en_US.utf8 | en_US.utf8 | =c/postgres          +
           |          |          |            |            | postgres=CTc/postgres
 test      | postgres | UTF8     | en_US.utf8 | en_US.utf8 | postgres=CTc/postgres
(4 rows)
```

We can see that after the apply, `psql` reports `=T/postgres` for the test database and not anymore after the destroy.

- Which version of Postgres are you using?
- How do you assert that it didn't work?
